jaliquiel/BlackJack_MSP430/main.c
/*
 * lab1.c
 *
 *  Created on: Jan 29, 2020
 *      Author: Jose Li
 */

/************** ECE2049 DEMO CODE ******************/
/**************  13 March 2019   ******************/
/***************************************************/

#include <msp430.h>
# include <stdio.h>

/* Peripherals.c and .h are where the functions that implement
 * the LEDs and keypad, etc are. It is often useful to organize
 * your code by putting like functions together in files.
 * You include the header associated with that file(s)
 * into the main file of your project. */
#include "peripherals.h"

// Function Prototypes
void swDelay(char numLoops);
unsigned char* getCardString(unsigned int card);
enum GAME_STATE {welcome = 0, cut =1, shuffle=2, bet=3, draw=4, cpu=5, loser=6, winner=7, end=8};
enum HAND_STATE {lost = 0, won =1, keepPlaying=2};

// Declare globals here


void main(void){
    // ... code



    while(1){




    unsigned char currKey=0, dispSz = 3;
    unsigned char dispThree[3] = {NULL, NULL, NULL};
    unsigned int deck[52] = {0};
    unsigned int topDeckIndex = 0; // represents the current index of the top of the deck

    unsigned char playerHand[10][3];
    unsigned char cpuHand[10][3];

    unsigned char playerBet;
    unsigned char cpuBet;

    // variables for lenght of players hand array
    int playerHandLen;
    int cpuHandLen;
    // current number of cards at each players hand
    int playerCards = 0;
    int cpuCards = 0;

    int endGame;
    bool restartGame = false;

    int cpuHandValue;
    int playerHandValue;




    WDTCTL = WDTPW | WDTHOLD;    // Stop watchdog timer. Always need to stop this!!
                                     // You can then configure it properly, if desired

        // Useful code starts here
        initLeds();

        configDisplay();
        configKeypad();

        // *** Intro Screen ***
        Graphics_clearDisplay(&g_sContext); // Clear the display

        // Draw a box around everything because it looks nice
        Graphics_Rectangle box = {.xMin = 5, .xMax = 91, .yMin = 5, .yMax = 91 };
        Graphics_drawRectangle(&g_sContext, &box);
        // Refresh the display so it shows the new data
        Graphics_flushBuffer(&g_sContext);

    enum GAME_STATE state = welcome;


    while (1)    // Forever loop
    {

//        currKey = getKey();

        switch(state){
        case welcome: // Start Screen

            // Write some text to the display
            Graphics_drawStringCentered(&g_sContext, "MSP430", AUTO_STRING_LENGTH, 48, 25, TRANSPARENT_TEXT);
            Graphics_drawStringCentered(&g_sContext, "BLACKJACK", AUTO_STRING_LENGTH, 48, 35, TRANSPARENT_TEXT);
            Graphics_drawStringCentered(&g_sContext, "Press *", AUTO_STRING_LENGTH, 48, 65, TRANSPARENT_TEXT);
            Graphics_drawStringCentered(&g_sContext, "to start", AUTO_STRING_LENGTH, 48, 75, TRANSPARENT_TEXT);

            // Refresh the display so it shows the new data
            Graphics_flushBuffer(&g_sContext);

            while(currKey != '*'){
                currKey = getKey();
            }
            if(currKey == '*'){
                Graphics_clearDisplay(&g_sContext); // Clear the display
                state = cut;
                currKey = NULL;
                dispThree[0] = NULL;
                dispThree[1] = NULL;
                dispThree[2] = NULL;

            }
            break;

        case cut: // Shuffle deck when user presses '*'
            // get input from 1 to 15 for cutting the deck
            // shuffle the deck using rand()
            // display to LCD current hand and opponent's hand
            // Write some text to the display
            Graphics_drawStringCentered(&g_sContext, "CUT THE DECK", AUTO_STRING_LENGTH, 48, 15, TRANSPARENT_TEXT);
            Graphics_drawStringCentered(&g_sContext, "enter number", AUTO_STRING_LENGTH, 48, 35, TRANSPARENT_TEXT);
            Graphics_drawStringCentered(&g_sContext, "from 0 - 15", AUTO_STRING_LENGTH, 48, 45, TRANSPARENT_TEXT);

            // Refresh the display so it shows the new data
            Graphics_flushBuffer(&g_sContext);

            // TODO SANITIZE INPUT if number is outside range *****************************************************************************************
            while(currKey != '*'){
                currKey = getKey();

                // if user has put input before, save input into second index
                if (dispThree[0] == NULL){
                    dispThree[0] = currKey;
                    Graphics_drawStringCentered(&g_sContext, dispThree, dispSz, 48, 65, OPAQUE_TEXT);
                    Graphics_flushBuffer(&g_sContext);
                    Graphics_flushBuffer(&g_sContext);
                }else{
                    dispThree[1] = currKey;
                }
                dispThree[2] = ' ';
                if (dispThree[1]){
                    break;
                }
            }

            Graphics_drawStringCentered(&g_sContext, dispThree, dispSz, 48, 65, OPAQUE_TEXT);
            Graphics_flushBuffer(&g_sContext);

            // get ready to switch state to shuffle
            if (dispThree[1])
            {
                // wait awhile before clearing LEDs
                currKey = NULL;
                state = shuffle;
                Graphics_clearDisplay(&g_sContext); // Clear the display

            }
            else if(currKey == '*'){
                Graphics_clearDisplay(&g_sContext); // Clear the display
                state = welcome;
                currKey = NULL;
            }
            break;


        case shuffle: // Wait for input from player
            // read input from player regarding bet
            // light up LED
            // Calculate CPU bet
            // display to LCD
            // let player input difference of bet or fold (*)
            // once bets are done, start new state of adding cards

            // Set the random seed
            // TODOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOO change true
            if (true){
                int a = dispThree[0] - '0';
                int b = dispThree[1] - '0';
                unsigned int seed = a*10 + b;
                srand(seed);
                unsigned char seedChar = seed + '0';

                if ((seed >= 0) && (seed <= 15)){
                    setLeds(seedChar - 0x30);
                }
            }

            unsigned int deckIndex;
            int i;
            // randomly assign a number from 1 to 52 into deck array
            for (i = 1; i < 53; i++){
                // find random unoccupied location
                do{
                    deckIndex = rand() % 52;
                }while(deck[deckIndex] != 0);

